C-A-Y-L-A-K/ESP32-CAM-Arduino/CameraWebServer/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "Arduino.h"
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"

// =============================================
// --- ALARM PIN TANIMLARI (Arduino Yok) ---
// =============================================
#define BUZZER_PIN   14   // Buzzer sinyali (uzun bacak)
#define SERVO_PIN    15   // Servo motor sinyal pini

// Servo PWM ayarları (50 Hz, 16-bit çözünürlük)
#define SERVO_FREQ       50
#define SERVO_RES        16
#define SERVO_CENTER_US  1500  // 90 derece (merkez) - mikrosaniye
#define SERVO_ALERT_US   2000  // ~180 derece (alarm konumu) - mikrosaniye

// Mikrosaniye -> LEDC duty değerine çevirme yardımcı makrosu
// Periyot = 1/50Hz = 20ms = 20000us; 16-bit -> 65536 adım
#define US_TO_DUTY(us) ((uint32_t)((us) * 65536UL / 20000UL))

// Global alarm durumu
volatile bool alarm_state = false;

// Servo'yu belirli bir mikrosaniye konumuna taşı
void setServoPosition(uint32_t pulse_us) {
  ledcWrite(SERVO_PIN, US_TO_DUTY(pulse_us));
}

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

// parse_get fonksiyonu asagida tanimlanmistir, onceden bildiriyoruz
static esp_err_t parse_get(httpd_req_t *req, char **obuf);

// =============================================
// --- ALARM HTTP HANDLER ---
// GET /alarm?state=1  -> Alarm Açık
// GET /alarm?state=0  -> Alarm Kapalı
// =============================================
static esp_err_t alarm_handler(httpd_req_t *req) {
  char *buf = NULL;
  char state_val[4];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  if (httpd_query_key_value(buf, "state", state_val, sizeof(state_val)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int state = atoi(state_val);
  alarm_state = (state == 1);

  if (alarm_state) {
    // --- ALARM AÇ ---
    digitalWrite(BUZZER_PIN, HIGH);          // Buzzer'ı çalıştır
    setServoPosition(SERVO_ALERT_US);        // Servo'yu alarm konumuna döndür
    log_i("[ALARM]: AKTIF - Buzzer ve Servo devrede!");
  } else {
    // --- ALARM KAPAT ---
    digitalWrite(BUZZER_PIN, LOW);           // Buzzer'ı sustur
    setServoPosition(SERVO_CENTER_US);       // Servo'yu merkeze döndür
    log_i("[ALARM]: PASİF - Sistem normal.");
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_type(req, "application/json");
  char resp[32];
  snprintf(resp, sizeof(resp), "{\"alarm\":%d}", alarm_state ? 1 : 0);
  return httpd_resp_send(req, resp, strlen(resp));
}

// =============================================
// --- SERVO MANUEL KONTROL HTTP HANDLER ---
// GET /servo?pos=<mikrosaniye>
// Ornek: /servo?pos=1000  -> sol
//        /servo?pos=1500  -> merkez
//        /servo?pos=2000  -> sag
// =============================================
static esp_err_t servo_handler(httpd_req_t *req) {
  char *buf = NULL;
  char pos_val[8];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  if (httpd_query_key_value(buf, "pos", pos_val, sizeof(pos_val)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  uint32_t pos = (uint32_t)atoi(pos_val);

  // Guvenlik siniri: 500us - 2500us arasinda tut
  if (pos < 500)  pos = 500;
  if (pos > 2500) pos = 2500;

